Revit 2024 API
TableCellCombinedParameterData.Separator Property
 The separator for this parameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Separator { get; set; }
Visual Basic
Public Property Separator As String
	Get
	Set
Visual C++
public:
property String^ Separator {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace